Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time
Change management time.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time.#ctor(System.Int32,System.DateTime)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time class.
id: The time identifier.
dateTime: The date and time.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time.Id
Gets or sets the time identifier.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time.DateTime
Gets or sets the date and time.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Time.FromUnixEpoch(System.Int32)
Get date and time from unix epoch time.
seconds: Seconds since 1.1.1970.
Returns: The date and time.